<?php

namespace App\Dictionaries;

class Majors
{
    public static function all(): array
    {
        return [

            /*
            |--------------------------------------------------------------------------
            | KHOA HỌC TỰ NHIÊN
            |--------------------------------------------------------------------------
            */

            'Toán học',
            'Toán ứng dụng',
            'Vật lý học',
            'Hóa học',
            'Sinh học',
            'Khoa học môi trường',
            'Khoa học vật liệu',


            /*
            |--------------------------------------------------------------------------
            | CÔNG NGHỆ THÔNG TIN
            |--------------------------------------------------------------------------
            */

            'Công nghệ thông tin',
            'Khoa học máy tính',
            'Kỹ thuật phần mềm',
            'Kỹ thuật máy tính',
            'Hệ thống thông tin',
            'An toàn thông tin',
            'Khoa học dữ liệu',
            'Trí tuệ nhân tạo',
            'Mạng máy tính và truyền thông dữ liệu',


            /*
            |--------------------------------------------------------------------------
            | KỸ THUẬT - CÔNG NGHỆ
            |--------------------------------------------------------------------------
            */

            'Kỹ thuật cơ khí',
            'Kỹ thuật cơ điện tử',
            'Kỹ thuật điện',
            'Kỹ thuật điện tử - viễn thông',
            'Kỹ thuật điều khiển và tự động hóa',
            'Kỹ thuật ô tô',
            'Kỹ thuật hóa học',
            'Kỹ thuật môi trường',
            'Kỹ thuật vật liệu',
            'Kỹ thuật nhiệt',
            'Kỹ thuật công nghiệp',


            /*
            |--------------------------------------------------------------------------
            | CÔNG NGHỆ KỸ THUẬT
            |--------------------------------------------------------------------------
            */

            'Công nghệ kỹ thuật cơ khí',
            'Công nghệ kỹ thuật ô tô',
            'Công nghệ kỹ thuật điện, điện tử',
            'Công nghệ kỹ thuật điều khiển và tự động hóa',
            'Công nghệ kỹ thuật điện tử - viễn thông',
            'Công nghệ kỹ thuật hóa học',


            /*
            |--------------------------------------------------------------------------
            | XÂY DỰNG - KIẾN TRÚC
            |--------------------------------------------------------------------------
            */

            'Kỹ thuật xây dựng',
            'Kỹ thuật xây dựng công trình giao thông',
            'Công nghệ kỹ thuật công trình xây dựng',
            'Quản lý xây dựng',
            'Kiến trúc',
            'Quy hoạch vùng và đô thị',


            /*
            |--------------------------------------------------------------------------
            | KINH TẾ - QUẢN TRỊ
            |--------------------------------------------------------------------------
            */

            'Kinh tế',
            'Kinh tế quốc tế',
            'Kinh tế phát triển',
            'Quản trị kinh doanh',
            'Kinh doanh quốc tế',
            'Marketing',
            'Thương mại điện tử',
            'Kế toán',
            'Kiểm toán',
            'Tài chính – Ngân hàng',
            'Quản trị nhân lực',
            'Logistics và quản lý chuỗi cung ứng',


            /*
            |--------------------------------------------------------------------------
            | LUẬT
            |--------------------------------------------------------------------------
            */

            'Luật',
            'Luật kinh tế',
            'Luật thương mại quốc tế',


            /*
            |--------------------------------------------------------------------------
            | NGOẠI NGỮ
            |--------------------------------------------------------------------------
            */

            'Ngôn ngữ Anh',
            'Ngôn ngữ Trung Quốc',
            'Ngôn ngữ Nhật',
            'Ngôn ngữ Hàn Quốc',
            'Ngôn ngữ Pháp',


            /*
            |--------------------------------------------------------------------------
            | DU LỊCH - DỊCH VỤ
            |--------------------------------------------------------------------------
            */

            'Quản trị dịch vụ du lịch và lữ hành',
            'Quản trị khách sạn',
            'Quản trị nhà hàng và dịch vụ ăn uống',
            'Du lịch',
            'Việt Nam học',


            /*
            |--------------------------------------------------------------------------
            | KHOA HỌC XÃ HỘI
            |--------------------------------------------------------------------------
            */

            'Công tác xã hội',
            'Tâm lý học',
            'Xã hội học',
            'Quan hệ quốc tế',
            'Đông phương học',
            'Báo chí',
            'Truyền thông đa phương tiện',
            'Thông tin - thư viện',


            /*
            |--------------------------------------------------------------------------
            | GIÁO DỤC - SƯ PHẠM
            |--------------------------------------------------------------------------
            */

            'Sư phạm Toán học',
            'Sư phạm Vật lý',
            'Sư phạm Hóa học',
            'Sư phạm Sinh học',
            'Sư phạm Ngữ văn',
            'Sư phạm Lịch sử',
            'Sư phạm Địa lý',
            'Sư phạm Tiếng Anh',
            'Giáo dục Tiểu học',
            'Giáo dục Mầm non',
            'Giáo dục thể chất',


            /*
            |--------------------------------------------------------------------------
            | NÔNG NGHIỆP
            |--------------------------------------------------------------------------
            */

            'Nông học',
            'Khoa học cây trồng',
            'Chăn nuôi',
            'Thú y',
            'Bảo vệ thực vật',
            'Khoa học đất',
            'Khuyến nông',
            'Phát triển nông thôn',


            /*
            |--------------------------------------------------------------------------
            | THỦY SẢN
            |--------------------------------------------------------------------------
            */

            'Nuôi trồng thủy sản',
            'Bệnh học thủy sản',
            'Khai thác thủy sản',


            /*
            |--------------------------------------------------------------------------
            | THỰC PHẨM - SINH HỌC
            |--------------------------------------------------------------------------
            */

            'Công nghệ thực phẩm',
            'Công nghệ sinh học',
            'Công nghệ sau thu hoạch',
            'Đảm bảo chất lượng và an toàn thực phẩm',


            /*
            |--------------------------------------------------------------------------
            | Y - DƯỢC
            |--------------------------------------------------------------------------
            */

            'Y khoa',
            'Y học dự phòng',
            'Y học cổ truyền',
            'Dược học',
            'Điều dưỡng',
            'Kỹ thuật xét nghiệm y học',
            'Kỹ thuật hình ảnh y học',
            'Phục hồi chức năng',
            'Y tế công cộng',
            'Răng - Hàm - Mặt',


            /*
            |--------------------------------------------------------------------------
            | NGHỆ THUẬT - THIẾT KẾ
            |--------------------------------------------------------------------------
            */

            'Thiết kế đồ họa',
            'Thiết kế thời trang',
            'Thiết kế nội thất',
            'Kiến trúc cảnh quan',
            'Mỹ thuật',
            'Âm nhạc',


            /*
            |--------------------------------------------------------------------------
            | TÀI NGUYÊN - MÔI TRƯỜNG
            |--------------------------------------------------------------------------
            */

            'Quản lý đất đai',
            'Quản lý tài nguyên và môi trường',
            'Quản lý tài nguyên nước',
            'Địa chất học',
            'Kỹ thuật địa chất',


            /*
            |--------------------------------------------------------------------------
            | GIAO THÔNG
            |--------------------------------------------------------------------------
            */

            'Kỹ thuật xây dựng công trình giao thông',
            'Kỹ thuật tàu thủy',
            'Kỹ thuật hàng không',


            /*
            |--------------------------------------------------------------------------
            | CÁC NGÀNH KHÁC
            |--------------------------------------------------------------------------
            */

            'Quản lý công nghiệp',
            'Quản lý nhà nước',
            'Quản lý văn hóa',
            'Quản lý giáo dục',
            'Quản trị văn phòng',
            'Lưu trữ học',

        ];
    }
}